app/views/book_comments/_book_comment.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
<h2>Book Comments</h2>
<% book.book_comments.each do |book_comment| %>