app/views/users/_index.html.erb

        <td><%= user.name %></td>
        <td>フォロー数：<%= user.following_user.count %></td>
---
SELECT "users".* FROM "users"