app/controllers/books_controller.rb

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @book = Book.new
    if sort_params.present?
      @books = Book.sort_books(sort_params)
    else
      @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aaaaaaaaa"], ["body", "aaaaaaaa"], ["user_id", 1], ["created_at", "2021-11-13 14:26:06.229166"], ["updated_at", "2021-11-13 14:26:06.229166"], ["rate", 3.5]]
SELECT "books".* FROM "books"